Hi all. This is still an issue with latest 4.55.0 version of the provider.

My plan:
```tf
Terraform will perform the following actions:

  # module.azure_fileserver["pc-0"].azurerm_managed_disk.this will be created
  + resource "azurerm_managed_disk" "this" {
      + create_option                     = "Copy"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 8000
      + id                                = (known after apply)
      + location                          = "francecentral"
      + logical_sector_size               = (known after apply)
      + max_shares                        = (known after apply)
      + name                              = "pc-0"
      + network_access_policy             = "AllowAll"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "[redacted-a]"
      + source_resource_id                = "/subscriptions/[redacted-b]/resourceGroups/[redacted-c]/providers/Microsoft.Compute/snapshots/foo-bar-pc-0"
      + source_uri                        = (known after apply)
      + storage_account_type              = "StandardSSD_LRS"
      + tags                              = {
          + "env"      = "[redacted-d]"
          + "platform" = "pc"
          + "role"     = "fileserver"
        }
      + tier                              = (known after apply)
    }
```

Apply:
```tf
module.azure_fileserver["pc-0"].azurerm_managed_disk.this: Creating...

 Error: creating/updating Managed Disk "pc-0" (Resource Group "[redacted-a]"): performing CreateOrUpdate: unexpected status 404 (404 Not Found) with error: NotFound: Resource foo-bar-pc-0 is not found.
 
   with module.azure_fileserver["pc-0"].azurerm_managed_disk.this,
   on modules/azure-fileserver/main.tf line 1, in resource "azurerm_managed_disk" "this":
    1: resource "azurerm_managed_disk" "this" {
```

I have verified that `/subscriptions/[redacted-b]/resourceGroups/[redacted-c]/providers/Microsoft.Compute/snapshots/foo-bar-pc-0` exists.

One note, the resource group where snapshot lives is not the same as the resource group where the disk is being created (if that matters). Subscription and location are the same.